{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "Embedding", "config": {"mask_zero": false, "name": "embedding_4", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "dtype": "float32", "output_dim": 50, "input_dim": 18318, "activity_regularizer": null, "input_length": 10, "batch_input_shape": [null, 10], "embeddings_regularizer": null, "trainable": true, "embeddings_constraint": null}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "name": "conv1d_4", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "strides": [1], "trainable": true, "kernel_size": [4], "filters": 128, "dilation_rate": [1]}}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 9, "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "sigmoid", "trainable": true}}]}}, "training_config": {"sample_weight_mode": null, "loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513, "decay": 0.0}}, "metrics": ["top2_acc"], "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d_4/kernel", "shape": [4, 50, 128], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [128, 9], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [9], "dtype": "float32"}, {"name": "embedding_4/embeddings", "shape": [18318, 50], "dtype": "float32"}]}]}